УчетВУправляющихДляГит1/src/InformationRegisters/УПЖКХ_ТипыПомещенийДляРаспределенияРасходаКПУ/УПЖКХ_ТипыПомещенийДляРаспределенияРасходаКПУ.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>УПЖКХ_ТипыПомещенийДляРаспределенияРасходаКПУ</name>
  <dimensions>
    <name>ТипПомещения</name>
    <type>
      <types>EnumRef.КВП_ТипыПомещений</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

УчетВУправляющихДляГит1/src/Enums/КВП_ТипыПомещений/КВП_ТипыПомещений.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>КВП_ТипыПомещений</name>
  <enumValues>
    <name>Квартира</name>
  </enumValues>
  <enumValues>
    <name>Офис</name>
  </enumValues>
  <enumValues>
    <name>Дом</name>
  </enumValues>
  <enumValues>
    <name>ПодсобноеПомещение</name>
  </enumValues>
  <enumValues>
    <name>МестоОбщегоПользования</name>
  </enumValues>
  <enumValues>
    <name>Автоместо</name>
  </enumValues>
  <enumValues>
    <name>Комната</name>
  </enumValues>
  <enumValues>
    <name>Кабинет</name>
  </enumValues>
  <enumValues>
    <name>Коридор</name>
  </enumValues>
  <enumValues>
    <name>Кухня</name>
  </enumValues>
  <enumValues>
    <name>Санузел</name>
  </enumValues>
  <enumValues>
    <name>Чердак</name>
  </enumValues>
  <enumValues>
    <name>Подвал</name>
  </enumValues>
  <enumValues>
    <name>Апартамент</name>
  </enumValues>
  <enumValues>
    <name>КваритрыДляАО</name>
  </enumValues>
  <enumValues>
    <name>ЖилыеПомещенияДляГИС</name>
  </enumValues>
  <enumValues>
    <name>НеЖилыеПомещенияДляГИС</name>
  </enumValues>
</mdclass:Enum>

УчетВУправляющихДляГит1/src/InformationRegisters/УПЖКХ_ТипыПомещенийДляРаспределенияРасходаКПУ/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область СлужебныеПроцедурыИФункции

// Функция возвращает массив типов помещений, для распределения расхода КПУ между объектами по площади.
// Описание:
//          Определяется с учетом настройки параметров учета. Если настройка не задана, тогда возвращается список 
//          типов помещений по умолчанию.
Функция ПолучитьСписокТиповПомещенийДляРаспределенияРасходаКПУ() Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	УПЖКХ_ТипыПомещенийДляРаспределенияРасходаКПУ.ТипПомещения
	|ИЗ
	|	РегистрСведений.УПЖКХ_ТипыПомещенийДляРаспределенияРасходаКПУ КАК УПЖКХ_ТипыПомещенийДляРаспределенияРасходаКПУ";
	
	МассивТиповПомещений = Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("ТипПомещения");
	
	Если МассивТиповПомещений.Количество() = 0 Тогда
		
		// Список по умолчанию.
		МассивТиповПомещений = Новый Массив;
		МассивТиповПомещений.Добавить(Перечисления.КВП_ТипыПомещений.Квартира);
		МассивТиповПомещений.Добавить(Перечисления.КВП_ТипыПомещений.Офис);
		
	КонецЕсли;
	
	Возврат МассивТиповПомещений;
	
КонецФункции // ПолучитьСписокТиповПомещенийДляРаспределенияРасходаКПУ()

#КонецОбласти

#КонецЕсли
